service-zhwg-ywkt-mtosi-master/template/烽火/request/performProtectionCommand.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1" xmlns:v11="http://www.tmforum.org/mtop/rtm/xsd/pc/v1" xmlns:v12="http://www.tmforum.org/mtop/fmw/xsd/nam/v1">
   <soapenv:Header>
      <v1:header>
         <v1:security>admin:admin</v1:security>
         <v1:communicationPattern>SimpleResponse</v1:communicationPattern>
         <v1:communicationStyle>RPC</v1:communicationStyle>
      </v1:header>
   </soapenv:Header>
   <soapenv:Body>
      <v11:performProtectionCommandRequest>
         <!--CLEAR、LOCKOUT、FORCED_SWITCH、MANUAL_SWITCH、EXERCISER-->
         <v11:protectionCommand>CLEAR</v11:protectionCommand>
         <v11:resourceRef>
            <v12:rdn>
               <v12:type>MD</v12:type>
               <v12:value>1</v12:value>
            </v12:rdn>
            <v12:rdn>
               <v12:type>ME</v12:type>
               <v12:value>7e37eb46-28ed-49d2-b6bd-1254ddfce272</v12:value>
            </v12:rdn>
            <v12:rdn>
               <v12:type>PG</v12:type>
               <v12:value>ca23f09e-7743-4d23-8fe6-0019cf9556c4</v12:value>
            </v12:rdn>
         </v11:resourceRef>
         <v11:fromTpRef>
            <v12:rdn>
               <v12:type>MD</v12:type>
               <v12:value>1</v12:value>
            </v12:rdn>
            <v12:rdn>
               <v12:type>ME</v12:type>
               <v12:value>7e37eb46-28ed-49d2-b6bd-1254ddfce272</v12:value>
            </v12:rdn>
            <!--v12:rdn>
               <v12:type>FTP</v12:type>
               <v12:value>/rack=1/shelf=1/slot=8/port=1</v12:value>
            </v12:rdn-->
            <v12:rdn>
               <v12:type>PTP</v12:type>
               <v12:value>/rack=1/shelf=1/slot=34/port=5</v12:value>
            </v12:rdn>
            <!--v12:rdn>
               <v12:type>FTP</v12:type>
               <v12:value>/type=vsdh/port=3</v12:value>
            </v12:rdn-->
            <!--v12:rdn>
               <v12:type>CTP</v12:type>
               <v12:value>/och=1/odu4=1</v12:value>
            </v12:rdn-->
            <!--v12:rdn>
               <v12:type>CTP</v12:type>
               <v12:value>/sts3c_au4-j=1/tu3_vc3-k=1</v12:value>
            </v12:rdn-->
            <v12:rdn>
               <v12:type>CTP</v12:type>
               <v12:value>/och=1/odu2=1/odu1=2</v12:value>
            </v12:rdn>
         </v11:fromTpRef>
         <v11:toTpRef>
            <v12:rdn>
               <v12:type>MD</v12:type>
               <v12:value>1</v12:value>
            </v12:rdn>
            <v12:rdn>
               <v12:type>ME</v12:type>
               <v12:value>7e37eb46-28ed-49d2-b6bd-1254ddfce272</v12:value>
            </v12:rdn>
            <!--v12:rdn>
               <v12:type>PTP</v12:type>
               <v12:value>/rack=1/shelf=1/slot=12/port=2</v12:value>
            </v12:rdn-->
            <v12:rdn>
               <v12:type>PTP</v12:type>
               <v12:value>/rack=1/shelf=1/slot=34/port=6</v12:value>
            </v12:rdn>
            <!--v12:rdn>
               <v12:type>FTP</v12:type>
               <v12:value>/type=vsdh/port=4</v12:value>
            </v12:rdn-->
            <!--v12:rdn>
               <v12:type>CTP</v12:type>
               <v12:value>/och=1/odu4=1</v12:value>
            </v12:rdn-->
            <!--v12:rdn>
               <v12:type>CTP</v12:type>
               <v12:value>/sts3c_au4-j=1/tu3_vc3-k=1</v12:value>
            </v12:rdn-->
            <v12:rdn>
               <v12:type>CTP</v12:type>
               <v12:value>/och=1/odu2=1/odu1=1</v12:value>
            </v12:rdn>
         </v11:toTpRef>
      </v11:performProtectionCommandRequest>
   </soapenv:Body>
</soapenv:Envelope>